---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailAngularDimensionTextPosition
source: html/cb37549a-6dfe-74a1-e0e4-b33f60f46c79.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailAngularDimensionTextPosition Property

"Angle Text Position"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailAngularDimensionTextPosition { get; }
```